URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "BCLt_WklwJSYdEf47tSekQ"], ["LIMIT", 1]]
---
  def self.random_code
    shortened = SecureRandom.urlsafe_base64
    while ShortenedUrl.exists?(short_url: shortened)

INSERT INTO "shortened_urls" ("short_url", "long_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def self.shorten(user, long_url)
    ShortenedUrl.create!(user_id: user.id, long_url: long_url, short_url: self.random_code)