URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 17], ["shortened_url_id", 12], ["created_at", "2018-12-12 21:55:36.919358"], ["updated_at", "2018-12-12 21:55:36.919358"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!(user_id: user.id, shortened_url_id: shortened_url.id )